//=============================================================================
//
// 計算の関数まとめ処理 [calculation.h]
// Author : KOZUNA HIROHITO
//
//=============================================================================

#ifndef _CALCULATION_H_			//このマクロ定義がされなかったら
#define _CALCULATION_H_			//2重インクルード防止のマクロ定義

//-----------------------------------------------------------------------------
//インクルードファイル
//-----------------------------------------------------------------------------

#include "main.h"

//-----------------------------------------------------------------------------
//プロトタイプ宣言
//-----------------------------------------------------------------------------

//rotが規定数より超えたときの補正（正規化）
float Normalization(float fRot);
//三平方の定理
float ThreeSquareTheorem(float fData1, float fData2);
#endif
