//=============================================================================
//
// カメラ処理 [camera.h]
// Author : KOZUNA HIROHITO
//
//=============================================================================

#ifndef _CAMERA_H_			//このマクロ定義がされなかったら
#define _CAMERA_H_			//2重インクルード防止のマクロ定義

//-----------------------------------------------------------------------------
//インクルードファイル
//-----------------------------------------------------------------------------

#include "main.h"

//-----------------------------------------------------------------------------
//構造体の定義
//-----------------------------------------------------------------------------

//カメラ構造体
typedef struct
{
	D3DXVECTOR3 posV;		//視点
	D3DXVECTOR3 posR;		//注視点
	D3DXVECTOR3 rot;		//カメラの向き
	D3DXVECTOR3 vecU;		//上方向ベクトル
	D3DXMATRIX mtxProjection; //プロジェクションマトリックス
	D3DXMATRIX mtxView;		  //ビューマトリックス
	float fDistance;			//視点か注視点のまでの距離

}Camera;

//-----------------------------------------------------------------------------
//プロトタイプ宣言
//-----------------------------------------------------------------------------

void InitCamera(void);
void UninitCamera(void);
void UpdateCamera(void);
void SetCamera(void);
Camera *GetCamera(void);

#endif