//**************************************************************************************************
//
// “–‚½‚è”»’è
// AuthorF¬jŒ[m
//
//**************************************************************************************************

//-----------------------------------------------------------------------------
//ƒCƒ“ƒNƒ‹[ƒhƒtƒ@ƒCƒ‹
//-----------------------------------------------------------------------------

#include "collision.h"

//-----------------------------------------------------------------------------
//‰~‚Ì“–‚½‚è”»’è
//-----------------------------------------------------------------------------
bool CollisionCircle(D3DXVECTOR3 Pos1, float fRadius1, D3DXVECTOR3 Pos2, float fRadius2)
{
	//‚Q‚±‚Ì•¨‘Ì‚Ì”¼Œa“¯Žm‚Ì˜a
	float fDiff = fRadius1 + fRadius2;

	//ŒvŽZ—p•Ï”
	float fCalculationX, fCalculationZ;

	//X‚Ì·•ª
	fCalculationX = Pos1.x - Pos2.x;
	//Y‚Ì·•ª
	fCalculationZ = Pos1.z - Pos2.z;

	//Œ»Ý‚Ì‚Q“_‚Ì‹——£
	float fLength = sqrtf(fCalculationX * fCalculationX + fCalculationZ * fCalculationZ);

	//‚Q‚±‚Ì•¨‘Ì‚Ì”¼Œa“¯Žm‚Ì˜a‚æ‚èŒ»Ý‚Ì‚Q“_‚Ì‹——£‚ª¬‚³‚¢‚©‚Ç‚¤‚©
	if (fDiff >= fLength)
	{
		//“–‚½‚Á‚½
		return true;
	}

	//“–‚½‚Á‚Ä‚È‚¢
	return false;
}