//=============================================================================
//
// リザルト処理 [result.h]
// Author : KADO TAKUMA
//
//=============================================================================
#ifndef _RESULT_H_
#define _RESULT_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"
#include "input.h"

//=============================================================================
// 構造体
//=============================================================================
typedef struct
{
	D3DXVECTOR3 pos;		//位置
	D3DXVECTOR3 move;		//移動量
}RESULT;

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitResult(void);
void UninitResult(void);
void UpdateResult(void);
void DrawResult(void);
void SetResult(int nSetCount1, int nSetCount2);
void SetCount(int nSetCount, D3DXVECTOR3 pos);
void ForcedFade(void);

#endif